hippoBus/pyoro-mms/stm32_code/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define RW_LED_Pin GPIO_PIN_13
#define RW_LED_GPIO_Port GPIOC
#define EMIT_FL_Pin GPIO_PIN_14
#define EMIT_FL_GPIO_Port GPIOC
#define EMIT_BL_Pin GPIO_PIN_15
#define EMIT_BL_GPIO_Port GPIOC
#define EMIT_FR_Pin GPIO_PIN_0
#define EMIT_FR_GPIO_Port GPIOH
#define EMIT_BR_Pin GPIO_PIN_1
#define EMIT_BR_GPIO_Port GPIOH
#define ML_ENC_B_Pin GPIO_PIN_0
#define ML_ENC_B_GPIO_Port GPIOA
#define ML_PWMB_Pin GPIO_PIN_1
#define ML_PWMB_GPIO_Port GPIOA
#define NEOPXL_PWM_Pin GPIO_PIN_3
#define NEOPXL_PWM_GPIO_Port GPIOA
#define RECIV_FL_Pin GPIO_PIN_5
#define RECIV_FL_GPIO_Port GPIOA
#define RECIV_BL_Pin GPIO_PIN_7
#define RECIV_BL_GPIO_Port GPIOA
#define RECIV_FR_Pin GPIO_PIN_0
#define RECIV_FR_GPIO_Port GPIOB
#define RECIV_BR_Pin GPIO_PIN_1
#define RECIV_BR_GPIO_Port GPIOB
#define SPI1_CS_Pin GPIO_PIN_2
#define SPI1_CS_GPIO_Port GPIOB
#define MR_ENC_A_Pin GPIO_PIN_10
#define MR_ENC_A_GPIO_Port GPIOB
#define RIGHT_LED_Pin GPIO_PIN_12
#define RIGHT_LED_GPIO_Port GPIOB
#define LEFT_LED_Pin GPIO_PIN_13
#define LEFT_LED_GPIO_Port GPIOB
#define FRONT_LED_Pin GPIO_PIN_14
#define FRONT_LED_GPIO_Port GPIOB
#define MR_ENC_B_Pin GPIO_PIN_15
#define MR_ENC_B_GPIO_Port GPIOB
#define MR_PWMB_Pin GPIO_PIN_8
#define MR_PWMB_GPIO_Port GPIOA
#define MR_PWMA_Pin GPIO_PIN_11
#define MR_PWMA_GPIO_Port GPIOA
#define BUZZER_PWM_Pin GPIO_PIN_12
#define BUZZER_PWM_GPIO_Port GPIOA
#define SWDIO_Pin GPIO_PIN_13
#define SWDIO_GPIO_Port GPIOA
#define SWCLK_Pin GPIO_PIN_14
#define SWCLK_GPIO_Port GPIOA
#define BIT3_LED_Pin GPIO_PIN_15
#define BIT3_LED_GPIO_Port GPIOA
#define BIT2_LED_Pin GPIO_PIN_3
#define BIT2_LED_GPIO_Port GPIOB
#define BIT1_LED_Pin GPIO_PIN_4
#define BIT1_LED_GPIO_Port GPIOB
#define ML_ENC_A_Pin GPIO_PIN_5
#define ML_ENC_A_GPIO_Port GPIOB
#define ML_PWMA_Pin GPIO_PIN_6
#define ML_PWMA_GPIO_Port GPIOB
#define BIT0_LED_Pin GPIO_PIN_7
#define BIT0_LED_GPIO_Port GPIOB
#define BACK_LED_Pin GPIO_PIN_8
#define BACK_LED_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
